; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v4 ?v2)
		(pred_3 ?v7)
		(pred_2 ?v5)
		(pred_1 ?v5)
		(pred_6 ?v7 ?v5)
		(pred_4)
		(pred_5 ?v7))

   (:action op_1
       :parameters  (?v6 ?v3)
       :precondition (and (not-eq ?v6 ?v3) 
                          (pred_2 ?v6) (pred_2 ?v3) (pred_1 ?v6))
       :effect (and  (pred_1 ?v3)
		     (not (pred_1 ?v6))))


   (:action op_2
       :parameters (?v1 ?v8)
       :precondition  (and  (pred_3 ?v1) (pred_2 ?v8)
			    (pred_6 ?v1 ?v8) (pred_1 ?v8) (pred_4))
       :effect (and (pred_5 ?v1)
		    (not (pred_6 ?v1 ?v8)) 
		    (not (pred_4))))

   (:action op_3
       :parameters  (?v1  ?v8)
       :precondition  (and  (pred_3 ?v1) (pred_2 ?v8)
			    (pred_5 ?v1) (pred_1 ?v8))
       :effect (and (pred_6 ?v1 ?v8)
		    (pred_4)
		    (not (pred_5 ?v1)))))

; problem
(define (problem ferry-l6-c3)
(:domain ferry)
(:objects obj_07 obj_05 obj_09 obj_02 obj_01 obj_08 
          obj_04 obj_03 obj_06 
)
(:init
(pred_2 obj_07)
(pred_2 obj_05)
(pred_2 obj_09)
(pred_2 obj_02)
(pred_2 obj_01)
(pred_2 obj_08)
(pred_3 obj_04)
(pred_3 obj_03)
(pred_3 obj_06)
(not-eq obj_07 obj_05)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_09)
(not-eq obj_09 obj_07)
(not-eq obj_07 obj_02)
(not-eq obj_02 obj_07)
(not-eq obj_07 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_08)
(not-eq obj_08 obj_07)
(not-eq obj_05 obj_09)
(not-eq obj_09 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_08)
(not-eq obj_08 obj_05)
(not-eq obj_09 obj_02)
(not-eq obj_02 obj_09)
(not-eq obj_09 obj_01)
(not-eq obj_01 obj_09)
(not-eq obj_09 obj_08)
(not-eq obj_08 obj_09)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_08)
(not-eq obj_08 obj_02)
(not-eq obj_01 obj_08)
(not-eq obj_08 obj_01)
(pred_4)
(pred_6 obj_04 obj_07)
(pred_6 obj_03 obj_09)
(pred_6 obj_06 obj_01)
(pred_1 obj_05)
)
(:goal
(and
(pred_6 obj_04 obj_01)
(pred_6 obj_03 obj_09)
(pred_6 obj_06 obj_01)
)
)

(:constraints
  (sometime-before  (pred_6 obj_04 obj_01) (pred_1 obj_09))
)
)

; plan
1. (op_1 obj_05 obj_09)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_09)
   goals met: 2 of 3
2. (op_2 obj_03 obj_09)
   deleted: (pred_6 obj_03 obj_09) (pred_4)
   added: (pred_5 obj_03)
   goals met: 1 of 3
3. (op_1 obj_09 obj_07)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_07)
   goals met: 1 of 3
4. (op_3 obj_03 obj_07)
   deleted: (pred_5 obj_03)
   added: (pred_6 obj_03 obj_07) (pred_4)
   goals met: 1 of 3
5. (op_2 obj_04 obj_07)
   deleted: (pred_6 obj_04 obj_07) (pred_4)
   added: (pred_5 obj_04)
   goals met: 1 of 3
6. (op_1 obj_07 obj_01)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_01)
   goals met: 1 of 3
7. (op_3 obj_04 obj_01)
   deleted: (pred_5 obj_04)
   added: (pred_6 obj_04 obj_01) (pred_4)
   goals met: 2 of 3
8. (op_1 obj_01 obj_07)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_07)
   goals met: 2 of 3
9. (op_2 obj_03 obj_07)
   deleted: (pred_6 obj_03 obj_07) (pred_4)
   added: (pred_5 obj_03)
   goals met: 2 of 3
10. (op_1 obj_07 obj_09)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_09)
   goals met: 2 of 3
11. (op_3 obj_03 obj_09)
   deleted: (pred_5 obj_03)
   added: (pred_6 obj_03 obj_09) (pred_4)
   goals met: 3 of 3
